// 정리
// 1. C 보다 좀 더 발전된 C++ 문법들 : auto, new, reference, namespace
//								       함수 특징들, template

// 2. 타입을 하나 만들때 사용하는 문법, class 문법
//    접근지정자, 생성자, 소멸자, 초기화 리스트
//    static 멤버, 상수 멤버함수, this

// 3. 상속 문법
//    상속에서의 생성자 원리
//    upcasting ( 기반 클래스 포인터로 파생 클래스 객체 가리킬수 있다.)
//		          vector<Shape*>
//    가상함수 : 언제 사용하는가 ? => "도형편집기 예제"
//              원리 => "가상함수 테이블"
//    기반 클래스 소멸자는 가상함수 이어야 한다.
//    순수가상함수, 추상 클래스, 인터페이스 용어
//    예제 : Edit 와 Validator 예제, 메뉴 예제
//    RTTI 기술, 다중상속등...

// 4. 연산자 재정의, 예외 문법. 복사 생성자
// 5. STL 사용법