 //문제 1 : 4
 //문제 2 : 2
 //문제 3 : 3
 //문제 4 : 1
 //문제 5 : 3
 //문제 6 : 4
 //문제 7 : 4
 //문제 8 : 1
 //문제 9 : 4
 //문제 10 : 3
 //문제 11 : 1
 //문제 12 : 1
 //문제 13 : 4
 //문제 14 : 3
 //문제 15 : 3
 //문제 16 : 2
 //문제 17 : 3
 //문제 18-1 : 3
 //문제 18-2 : 4
 //문제 19 : 3
 //문제 20 : 4


// C++ 기본 과정 수료 후
// 1. 기본 문법을 좀 복습하면서 "객체지향 디자인 공부해 보세요"
// 2. Modern C++ 문법과 C++ 중급 문법(effective-C++ 책 정도)
// 3. STL도 시중에서 서적하나 구입해서 학습해 보세요..
// 4. 삼성에 있는 다른 "C++관련 과정도 수강해보세요.."

// 과정 종료 후 질문은 메일로 보내주세요
// smkang @ codenuri.co.kr
